reddit_on_rails/app/controllers/application_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_moderator(sub_id)
    unless current_user.id == Sub.find_by(id: sub_id).moderator_id

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_author(post_id)
    unless current_user.id == Post.find_by(id: post_id).author_id