reddit_on_rails/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "      aerghaerghre"], ["author_id", 2], ["post_id", 2], ["parent_comment_id", 1], ["created_at", "2018-09-18 23:25:58.244130"], ["updated_at", "2018-09-18 23:25:58.244130"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    @comment.post_id = params[:post_id]
    @comment.parent_comment_id = params[:comment][:parent_comment_id]

    if @comment.save

UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "              aerghaerghre\r\n      "], ["updated_at", "2018-09-18 23:42:38.876964"], ["id", 2]]
---
  def update
    @comment = current_user.comments.find_by(id: params[:id])
    if @comment.update_attributes(comment_params)