reddit_on_rails/app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs"
---
  def new
    @post = Post.new
    @post.sub_id = params[:sub_id]
    @subs = Sub.all

SELECT "subs".* FROM "subs"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @subs = Sub.all
    @post = Post.find_by(id: params[:id])

SELECT "subs".* FROM "subs"
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 1], ["sub_id", 1], ["created_at", "2018-09-18 19:16:22.351245"], ["updated_at", "2018-09-18 19:16:22.351245"]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asdf"], ["url", "asdfasdfasdf"], ["content", ""], ["sub_id", 1], ["author_id", 2], ["created_at", "2018-09-18 19:16:22.258460"], ["updated_at", "2018-09-18 19:16:22.258460"]]
---
  def create
    @subs = Sub.all
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    @post.author_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "url" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["url", "http://google.com"], ["updated_at", "2018-09-18 20:38:02.714315"], ["id", 1]]
---
  def update
    @subs = Sub.all
    @post = current_user.posts.find_by(id: params[:id])
    if @post.update_attributes(post_params)