reddit_on_rails/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND (parent_comment_id is null)  [["post_id", 2]]
---
<ul class="no-list-style">
  <% @post.comments.where("parent_comment_id is null").each do |comment| %>